---
kind: type
id: T:Autodesk.Revit.DB.LinkOperations
source: html/882834db-0bdc-4a40-ac75-4135d27bfb46.htm
---
# Autodesk.Revit.DB.LinkOperations

This class is used to extend the IExternalResourceServer interface with methods to support operations
 for elements that are LinkTypes.

## Syntax (C#)
```csharp
public class LinkOperations : IDisposable
```